artillery.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 1
      arrivalCount: 100
  payload:
    path: "./data.csv" # 프로젝트 루트 디렉토리에 있는 data.csv 파일을 사용합니다.
    fields:
      - "email"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Decrement order price"
    flow:
      - post:
          url: "/api/orders/decrement"
          json:
            orderId: 1